
# -*- coding: utf-8 -*-

# 座標は全て間接座標
CONFIG_GEN_ROUTES = {
    # 開始座標はinsertの終了座標
    'approach': {
        # 直交座標XYZの経路生成設定
        'xyz': {
            # 組み合わせ生成のための球面座標の範囲
            # 角度座標θ範囲 [最小値[deg], 最大値[deg], （原点を除く）経由点数]
            'theta': [0, 90, 9],
            # 角度座標Φ範囲 [最小値[deg], 最大値[deg], （原点を除く）経由点数]
            'phi': [-180, 180, 30],
            # 動径座標r [終了座標(動径)[m], （原点を除く）経由点数]
            'radius': [0.2, 50]
        },
        # 'abc': {
        #     # 直交座標ABCの経路生成設定
        #     # 経由点数はapproach.xyz.radius[1]に依存
        #     # 終了座標  [a[deg], b[deg], c[deg]]
        #     'end': [0, 0, 0]
        # }
        'abc': None
    },
    # 挿入位置から挿入位置上空までの経路生成のための設定
    'insert': {
        # 終了（挿入位置上空）座標 [x[m], y[m], z[m], (a[deg], b[deg], c[deg])]
        'end': [0., 0., 0.03, 0., 0., 0.],
        # （原点を除く）経由点数
        'steps': 10
    }
}
